IRP/src/InformationRegisters/T9014S_AccountsExpenseRevenue/T9014S_AccountsExpenseRevenue.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>T9014S_AccountsExpenseRevenue</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>AccountExpense</name>
    <type>
      <types>ChartOfAccountsRef.Basic</types>
    </type>
  </resources>
  <resources>
    <name>AccountRevenue</name>
    <type>
      <types>ChartOfAccountsRef.Basic</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LedgerTypeVariant</name>
    <type>
      <types>CatalogRef.LedgerTypeVariants</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ExpenseRevenue</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ProfitLossCenter</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Expense</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Revenue</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9014S_AccountsExpenseRevenue/Forms/RecordForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisObject.Items.RecordType.ChoiceList.Add("All", R().CLV_1);
	ThisObject.Items.RecordType.ChoiceList.Add("ProfitLossCenter", R().AccountingInfo_03);
	ThisObject.Items.RecordType.ChoiceList.Add("ExpenseRevenue", R().AccountingInfo_04);
	ThisObject.Items.RecordType.ChoiceList.Add("ExpenseRevenueAndProfitLossCenter", R().AccountingInfo_05);
	
	If ValueIsFilled(Record.ExpenseRevenue) And ValueIsFilled(Record.ProfitLossCenter) Then
		ThisObject.RecordType = "ExpenseRevenueAndProfitLossCenter";
	ElsIf ValueIsFilled(Record.ExpenseRevenue) Then
		ThisObject.RecordType = "ExpenseRevenue";
	ElsIf ValueIsFilled(Record.ProfitLossCenter) Then
		ThisObject.RecordType = "ProfitLossCenter";
	Else
		ThisObject.RecordType = "All";
	EndIf;
	SetVisible();
EndProcedure

&AtClient
Procedure RecordTypeOnChange(Item)
	SetVisible();
EndProcedure

&AtClient
Procedure ExpenseOnChange(Item)
	SetVisible();
EndProcedure

&AtClient
Procedure RevenueOnChange(Item)
	SetVisible();
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	If ThisObject.RecordType <> "ExpenseRevenue" And ThisObject.RecordType <> "ExpenseRevenueAndProfitLossCenter" Then
		CurrentObject.ExpenseRevenue = Undefined;
	EndIf;
	
	If ThisObject.RecordType <> "ProfitLossCenter" And ThisObject.RecordType <> "ExpenseRevenueAndProfitLossCenter" Then
		CurrentObject.ProfitLossCenter = Undefined;
	EndIf;
	
	If Not Record.Expense Then
		CurrentObject.AccountExpense = Undefined;
	EndIf;
	
	If Not Record.Revenue Then
		CurrentObject.AccountRevenue = Undefined;
	EndIf;
EndProcedure

&AtServer
Procedure SetVisible()
	Items.ExpenseRevenue.Visible = (ThisObject.RecordType = "ExpenseRevenue" Or ThisObject.RecordType = "ExpenseRevenueAndProfitLossCenter");
	Items.ProfitLossCenter.Visible = (ThisObject.RecordType = "ProfitLossCenter" Or ThisObject.RecordType = "ExpenseRevenueAndProfitLossCenter");

	Items.AccountExpense.Visible = Record.Expense;
	Items.AccountRevenue.Visible = Record.Revenue;
EndProcedure
